In [1791]:
import pandas as pd
import numpy as np

In [1792]:
a = {
     'a': list(range(50,100,2)),
     'b': list(range(1,50,2))
}

In [1793]:
df = pd.DataFrame(a,index=list(range(25)))
df.head()

    a  b
0  50  1
1  52  3
2  54  5
3  56  7
4  58  9

In [1794]:
df.columns=['a1','a2']
df.tail()

    a1  a2
20  90  41
21  92  43
22  94  45
23  96  47
24  98  49

In [1795]:
new_data = {'a1':[500],'a2':[1000]}
new = pd.DataFrame(new_data)
new

    a1    a2
0  500  1000

In [1796]:
val = pd.concat([df[:2],new,df[2:]]) #passing in [] as one arg
val.reset_index(drop=True,inplace=True)
val.head()

    a1    a2
0   50     1
1   52     3
2  500  1000
3   54     5
4   56     7

In [1797]:
val.iloc[1,0] #accesss through iloc

np.int64(52)

In [1798]:
val.loc[1,'a1'] #acces theruogh loc

np.int64(52)

In [1799]:
val.head()

    a1    a2
0   50     1
1   52     3
2  500  1000
3   54     5
4   56     7

## Lambda

In [1800]:
val['result'] = val['a1'].apply(lambda x:'pass' if x>55 else 'fail')
val.head()

    a1    a2 result
0   50     1   fail
1   52     3   fail
2  500  1000   pass
3   54     5   fail
4   56     7   pass

In [1801]:
val['binary'] = val['result'].apply(lambda x:0 if x == 'fail' else 1)
val.head()

    a1    a2 result  binary
0   50     1   fail       0
1   52     3   fail       0
2  500  1000   pass       1
3   54     5   fail       0
4   56     7   pass       1

In [1802]:
val['sum'] = val['a1'] + val['a2']
val.head()

    a1    a2 result  binary   sum
0   50     1   fail       0    51
1   52     3   fail       0    55
2  500  1000   pass       1  1500
3   54     5   fail       0    59
4   56     7   pass       1    63

In [1803]:
temp = np.arange(35)

In [1804]:
temp1 = pd.DataFrame(np.arange(35).reshape((5,7)),
index=list(range(5)),
columns=list(range(7)))
temp1

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [1805]:
avg_week = temp1.mean(axis=1)
avg_week

0     3.0
1    10.0
2    17.0
3    24.0
4    31.0
dtype: float64

In [1806]:
avg_sum = temp1.sum(axis=0)
avg_sum

0     70
1     75
2     80
3     85
4     90
5     95
6    100
dtype: int64

In [1807]:
temp1

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

## ILOC and LOC

In [1808]:
temp1.iloc[0,:] = 7
temp1

    0   1   2   3   4   5   6
0   7   7   7   7   7   7   7
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [1809]:
data = temp1.iloc[2:4,2:5]
data.index = list(range(2))
data.columns = list(range(3))
data

    0   1   2
0  16  17  18
1  23  24  25

fancy indexing in specific access

In [1810]:
print(temp1.iloc[[2,4]]) #Note down that 
print(temp1.iloc[[2,4],[2,4]])

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
    2   4
2  16  18
4  30  32

In [1811]:
df = pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df

   a  b
0  1  2
1  3  4

In [1812]:
df1 = pd.DataFrame([[5,6],[7,8]],columns=['a','c'])
df1

   a  c
0  5  6
1  7  8

In [1813]:
combine = pd.concat([df,df1])
combine

#issues is use do addition

   a    b    c
0  1  2.0  NaN
1  3  4.0  NaN
0  5  NaN  6.0
1  7  NaN  8.0

In [1814]:
combine = pd.concat([df,df1],ignore_index=True)
combine

   a    b    c
0  1  2.0  NaN
1  3  4.0  NaN
2  5  NaN  6.0
3  7  NaN  8.0

## ReIndex

In [1815]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),index=list('dac'),columns=list('xyz'))
frame

   x  y  z
d  0  1  2
a  3  4  5
c  6  7  8

In [1816]:
frame = frame.reindex(list('abcde'))
frame

     x    y    z
a  3.0  4.0  5.0
b  NaN  NaN  NaN
c  6.0  7.0  8.0
d  0.0  1.0  2.0
e  NaN  NaN  NaN

In [1817]:
frame = frame.reindex(columns=list('yzox'))
frame

     y    z   o    x
a  4.0  5.0 NaN  3.0
b  NaN  NaN NaN  NaN
c  7.0  8.0 NaN  6.0
d  1.0  2.0 NaN  0.0
e  NaN  NaN NaN  NaN

In [1818]:
frame = frame.reindex(index=list('ade'),columns=list('yx'))
frame

     y    x
a  4.0  3.0
d  1.0  0.0
e  NaN  NaN

## Droppp

In [1819]:
df = frame.drop('y',axis=1)
df

     x
a  3.0
d  0.0
e  NaN

In [1820]:
df = frame.drop('e',axis=0)
df

     y    x
a  4.0  3.0
d  1.0  0.0

## Set Axis

In [1821]:
df = pd.DataFrame(np.arange(10,70,10).reshape(3,2))
df

    0   1
0  10  20
1  30  40
2  50  60

In [1822]:
df2 =df.set_axis(list('abc'),axis=0)
df2

    0   1
a  10  20
b  30  40
c  50  60

In [1823]:
df.index = list('abc')
df
#easy way

    0   1
a  10  20
b  30  40
c  50  60

In [1824]:
df2 = df.set_axis(list('mn'),axis=1)
df2

    m   n
a  10  20
b  30  40
c  50  60

## Set Index

In [1825]:
df2

    m   n
a  10  20
b  30  40
c  50  60

In [1826]:
df2.set_index('m',inplace=True)

In [1827]:
df2.loc[10,'n']

np.int64(20)

In [1828]:
df2

     n
m
10  20
30  40
50  60

In [1829]:
##back to normal

In [1830]:
df2.reset_index(inplace=True)
df2

    m   n
0  10  20
1  30  40
2  50  60

In [1831]:
df2.iloc[0,:] = ['data','col']
df2

C:\Users\Naisarg\AppData\Local\Temp\ipykernel_42116\1472582118.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'data' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df2.iloc[0,:] = ['data','col']
C:\Users\Naisarg\AppData\Local\Temp\ipykernel_42116\1472582118.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'col' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df2.iloc[0,:] = ['data','col']

      m    n
0  data  col
1    30   40
2    50   60

In [1832]:
df2.columns = df2.iloc[0,:]
df2.drop(0,axis=0,inplace=True)
df2

0 data col
1   30  40
2   50  60

In [1833]:
obj = pd.Series(['blue','ornage','yellow'],index=[0,2,4,])
obj

0      blue
2    ornage
4    yellow
dtype: object

In [1834]:
obj.reindex(range(6))

0      blue
1       NaN
2    ornage
3       NaN
4    yellow
5       NaN
dtype: object

In [1835]:
obj=obj.reindex(range(6),method='ffill')
#bfill
obj

0      blue
1      blue
2    ornage
3    ornage
4    yellow
5    yellow
dtype: object

## Arithmetic alignment

In [1836]:
df1 = pd.DataFrame(np.arange(12).reshape(3, 4),columns=list('abcd'))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [1837]:
df2= pd.DataFrame(np.arange(20).reshape(4,5),columns=list('abcde'))
df2.loc[1, 'b'] = np.nan
df2

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [1838]:
df1.add(df2,fill_value=0)
#addition of all value and whewre noothing to add there instead of nan its replace with 0

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

## can add new column at spepcific pos

In [1839]:
df1.insert(2,"yaho",list(range(3)))
df1

   a  b  yaho   c   d
0  0  1     0   2   3
1  4  5     1   6   7
2  8  9     2  10  11

In [1840]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   yaho    3 non-null      int64
 3   c       3 non-null      int64
 4   d       3 non-null      int64
dtypes: int64(5)
memory usage: 252.0 bytes

## changing datatype

In [1841]:
df1['yaho'] = df1['yaho'].astype(float)
df1

   a  b  yaho   c   d
0  0  1   0.0   2   3
1  4  5   1.0   6   7
2  8  9   2.0  10  11

## Lambda

In [1842]:
df1["A"]  = df1['d'].apply(lambda x: x**2)
df1

   a  b  yaho   c   d    A
0  0  1   0.0   2   3    9
1  4  5   1.0   6   7   49
2  8  9   2.0  10  11  121

In [1843]:
df1['sumofab'] = df1.apply(lambda row:row['a'] + row['b'],axis=1)
df1

   a  b  yaho   c   d    A  sumofab
0  0  1   0.0   2   3    9      1.0
1  4  5   1.0   6   7   49      9.0
2  8  9   2.0  10  11  121     17.0

In [1844]:
df1 = {
    'a': [5,6,'invalid'],
    'b':[7,'invalid',7]
}

In [1845]:
df1 = pd.DataFrame(df1)
df1

         a        b
0        5        7
1        6  invalid
2  invalid        7

In [1846]:
df1 = df1.apply(pd.to_numeric, errors='coerce')
df1

     a    b
0  5.0  7.0
1  6.0  NaN
2  NaN  7.0

In [1847]:
df1 = df1.fillna(80)
df1

      a     b
0   5.0   7.0
1   6.0  80.0
2  80.0   7.0

## Replace value

In [1848]:
df1 = df1.replace(80,90)
df1

      a     b
0   5.0   7.0
1   6.0  90.0
2  90.0   7.0

In [1849]:
df1['val'] = (df1['b']/2)*100
df1

      a     b     val
0   5.0   7.0   350.0
1   6.0  90.0  4500.0
2  90.0   7.0   350.0

## Sort Index

In [1850]:
df = pd.DataFrame(np.arange(6).reshape(3,2),index=[3,1,2],columns=['m','b'])
df

   m  b
3  0  1
1  2  3
2  4  5

In [1851]:
df.sort_index()

   m  b
1  2  3
2  4  5
3  0  1

In [1852]:
df.sort_index(axis=1)

   b  m
3  1  0
1  3  2
2  5  4

In [1853]:
df.sort_index(axis=0,ascending=False)

   m  b
3  0  1
2  4  5
1  2  3

## Sort Values

In [1854]:
df2=df.sort_values(by='m',ascending=False)
df2

   m  b
2  4  5
1  2  3
3  0  1

In [1855]:
df2.reset_index(drop=True)

   m  b
0  4  5
1  2  3
2  0  1

## Rank

In [1856]:
df2['Rank'] = df2['b'].rank()
df2.reset_index(drop=True)

   m  b  Rank
0  4  5   3.0
1  2  3   2.0
2  0  1   1.0

In [1857]:
df = pd.DataFrame({
'Name':['A','B','C','D','E'],
'Marks':[90,92,85,85,91]

})

df

  Name  Marks
0    A     90
1    B     92
2    C     85
3    D     85
4    E     91

In [1858]:
df['Rank'] = df['Marks'].rank(method='dense',ascending=True)
df

  Name  Marks  Rank
0    A     90   2.0
1    B     92   4.0
2    C     85   1.0
3    D     85   1.0
4    E     91   3.0

In [1859]:
df = pd.DataFrame({
'Name': ['A', 'B', 'C'],
'Maths': [90, 85, 95],
'Science': [88, 92, 90],
'English': [75, 80, 95]

})

df

  Name  Maths  Science  English
0    A     90       88       75
1    B     85       92       80
2    C     95       90       95

In [1860]:
df[['Maths+rank','Science+rank','English+rank']] = df[['Maths','Science','English']].rank(ascending=True,method='dense')
df

  Name  Maths  Science  English  Maths+rank  Science+rank  English+rank
0    A     90       88       75         2.0           1.0           1.0
1    B     85       92       80         1.0           3.0           2.0
2    C     95       90       95         3.0           2.0           3.0

In [1861]:
df['Total'] = df.apply(lambda x:x[1]+x[2]+x[3],axis=1)
df

C:\Users\Naisarg\AppData\Local\Temp\ipykernel_42116\2873688418.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df['Total'] = df.apply(lambda x:x[1]+x[2]+x[3],axis=1)

  Name  Maths  Science  English  Maths+rank  Science+rank  English+rank  Total
0    A     90       88       75         2.0           1.0           1.0    253
1    B     85       92       80         1.0           3.0           2.0    257
2    C     95       90       95         3.0           2.0           3.0    280

In [1862]:
df['percetnilte'] = df['Total'].rank(pct=True)*100
df

,Name,Maths,Science,English,Maths+rank,Science+rank,English+rank,Total,percetnilte
0,A,90,88,75,2.0,1.0,1.0,253,33.333333
1,B,85,92,80,1.0,3.0,2.0,257,66.666667
2,C,95,90,95,3.0,2.0,3.0,280,100.000000

In [1863]:


df['grade'] = np.where(
    df['percetnilte'] >= 75, "great",
    np.where(df['percetnilte'] >= 30, "good", "not good")
)
df

,Name,Maths,Science,English,Maths+rank,Science+rank,English+rank,Total,percetnilte,grade
0,A,90,88,75,2.0,1.0,1.0,253,33.333333,good
1,B,85,92,80,1.0,3.0,2.0,257,66.666667,good
2,C,95,90,95,3.0,2.0,3.0,280,100.000000,great

In [1864]:
df['Name'].unique()

array(['A', 'B', 'C'], dtype=object)

## three

In [1865]:
from numpy import nan as NA

In [1866]:
data=pd.DataFrame([[1.,6.5,3.], [1.,NA, NA], [NA, NA, NA], [NA, 6.5, 3.]],
index = [1,2,3,4], columns=['A' , 'B' ,'C' ])

data

     A    B    C
1  1.0  6.5  3.0
2  1.0  NaN  NaN
3  NaN  NaN  NaN
4  NaN  6.5  3.0

In [1867]:
data.isnull().sum()

A    2
B    2
C    2
dtype: int64

In [1868]:
data.isnull().sum(axis=1)

1    0
2    2
3    3
4    1
dtype: int64

## drop na

In [1869]:
data.dropna(axis=0,how="all")

     A    B    C
1  1.0  6.5  3.0
2  1.0  NaN  NaN
4  NaN  6.5  3.0

In [1870]:
data.iloc[0,1] = np.nan
data

     A    B    C
1  1.0  NaN  3.0
2  1.0  NaN  NaN
3  NaN  NaN  NaN
4  NaN  6.5  3.0

In [1871]:
data.dropna(thresh=2,axis=1,inplace=True)
#thresh

In [1872]:
data

     A    C
1  1.0  3.0
2  1.0  NaN
3  NaN  NaN
4  NaN  3.0

## filna

In [1873]:
data.fillna(method='ffill',limit=1,inplace=True)

C:\Users\Naisarg\AppData\Local\Temp\ipykernel_42116\1412729272.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='ffill',limit=1,inplace=True)

In [1874]:
data.fillna(method='bfill',limit=1)

C:\Users\Naisarg\AppData\Local\Temp\ipykernel_42116\3820777286.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='bfill',limit=1)

     A    C
1  1.0  3.0
2  1.0  3.0
3  1.0  3.0
4  NaN  3.0

In [1875]:
data.fillna(method='ffill',limit=1,inplace=True)

C:\Users\Naisarg\AppData\Local\Temp\ipykernel_42116\1412729272.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='ffill',limit=1,inplace=True)

## duplicats

In [1876]:
data.drop_duplicates(['A'],keep='last')

     A    C
4  1.0  3.0

In [1877]:
data.drop_duplicates(['A'])

     A    C
1  1.0  3.0

In [1878]:
data.drop_duplicates()

     A    C
1  1.0  3.0

In [1879]:
data.duplicated()

1    False
2     True
3     True
4     True
dtype: bool

## outlier remover

In [1880]:
df1=df.drop(["grade","Name"],axis=1)

In [1881]:
df1

,Maths,Science,English,Maths+rank,Science+rank,English+rank,Total,percetnilte
0,90,88,75,2.0,1.0,1.0,253,33.333333
1,85,92,80,1.0,3.0,2.0,257,66.666667
2,95,90,95,3.0,2.0,3.0,280,100.000000

In [1882]:
df1.mean()

Maths            90.000000
Science          90.000000
English          83.333333
Maths+rank        2.000000
Science+rank      2.000000
English+rank      2.000000
Total           263.333333
percetnilte      66.666667
dtype: float64

In [1883]:
df1['Maths'].mean()

np.float64(90.0)

In [1884]:
df1.median()

Maths            90.000000
Science          90.000000
English          80.000000
Maths+rank        2.000000
Science+rank      2.000000
English+rank      2.000000
Total           257.000000
percetnilte      66.666667
dtype: float64

In [1885]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Maths         3 non-null      int64
 1   Science       3 non-null      int64
 2   English       3 non-null      int64
 3   Maths+rank    3 non-null      float64
 4   Science+rank  3 non-null      float64
 5   English+rank  3 non-null      float64
 6   Total         3 non-null      int64
 7   percetnilte   3 non-null      float64
dtypes: float64(4), int64(4)
memory usage: 324.0 bytes

In [1886]:
df1.describe()

,Maths,Science,English,Maths+rank,Science+rank,English+rank,Total,percetnilte
count,3.0,3.0,3.000000,3.0,3.0,3.0,3.000000,3.000000
mean,90.0,90.0,83.333333,2.0,2.0,2.0,263.333333,66.666667
std,5.0,2.0,10.408330,1.0,1.0,1.0,14.571662,33.333333
min,85.0,88.0,75.000000,1.0,1.0,1.0,253.000000,33.333333
25%,87.5,89.0,77.500000,1.5,1.5,1.5,255.000000,50.000000
50%,90.0,90.0,80.000000,2.0,2.0,2.0,257.000000,66.666667
75%,92.5,91.0,87.500000,2.5,2.5,2.5,268.500000,83.333333
max,95.0,92.0,95.000000,3.0,3.0,3.0,280.000000,100.000000

In [1887]:
df1

,Maths,Science,English,Maths+rank,Science+rank,English+rank,Total,percetnilte
0,90,88,75,2.0,1.0,1.0,253,33.333333
1,85,92,80,1.0,3.0,2.0,257,66.666667
2,95,90,95,3.0,2.0,3.0,280,100.000000

In [1888]:
df1.iloc[1:2,0:2] = np.nan
df1

,Maths,Science,English,Maths+rank,Science+rank,English+rank,Total,percetnilte
0,90.0,88.0,75,2.0,1.0,1.0,253,33.333333
1,NaN,NaN,80,1.0,3.0,2.0,257,66.666667
2,95.0,90.0,95,3.0,2.0,3.0,280,100.000000

In [1890]:
df1

,Maths,Science,English,Maths+rank,Science+rank,English+rank,Total,percetnilte
0,90.0,88.0,75,2.0,1.0,1.0,253,33.333333
1,90.0,NaN,80,1.0,3.0,2.0,257,66.666667
2,95.0,90.0,95,3.0,2.0,3.0,280,100.000000

In [1893]:
df1

,Maths,Science,English,Maths+rank,Science+rank,English+rank,Total,percetnilte
0,90.0,88.0,75,2.0,1.0,1.0,253,33.333333
1,90.0,NaN,80,1.0,3.0,2.0,257,66.666667
2,95.0,90.0,95,3.0,2.0,3.0,280,100.000000

## reacpling values

In [ ]:
df1['Maths'] = df['Maths'].fillna(df['Maths'].median())
df1

#

,Maths,Science,English,Maths+rank,Science+rank,English+rank,Total,percetnilte
0,90,88.0,75,2.0,1.0,1.0,253,33.333333
1,85,NaN,80,1.0,3.0,2.0,257,66.666667
2,95,90.0,95,3.0,2.0,3.0,280,100.000000

In [1900]:
df1['Science'].mode()[0]

np.float64(88.0)

In [1901]:
df1['Science'] = df1['Science'].fillna(df1['Science'].mode()[0])

In [1902]:
df1

,Maths,Science,English,Maths+rank,Science+rank,English+rank,Total,percetnilte
0,90,88.0,75,2.0,1.0,1.0,253,33.333333
1,85,88.0,80,1.0,3.0,2.0,257,66.666667
2,95,90.0,95,3.0,2.0,3.0,280,100.000000